HSDTaskName = "Junk Fax Blocking";

//progress title when printing the junk fax list
PRINT_PROGRESS_TITLE = "Printing… Please wait";

//button titles
DONE = "Done";
YES = "Yes";
NO = "No";
OK = "OK";
CLOSE = "Close";
DeleteButtonTitle = "Delete";

//Block status label
BLOCK_STATUS_MESSAGE = "%1$d of %2$d entries used";

//Not a valid block fax number
INVALID_FAX_NUMBER_TITLE = "Invalid Fax Number";
INVALID_FAX_NUMBER_DESC = "You have entered an invalid number. Only numerals (0123456789) may be entered. Please enter a valid fax number and try again.";

//Caller ID required warning message, when Block status is made ON
JUNK_FAX_WARNING_TITLE = "Caller ID Required";
JUNK_FAX_WARNING_DESC = "Junk Fax Blocking requires that your device connect to a line with Caller ID enabled.\n\nIf you are unsure if your line has Caller ID enabled, please contact your telephone service provider.";
JUNK_FAX_DELETION_DESC = "Are you sure you want to delete the selected number(s) from the Blocked Fax Numbers list?";

//Duplicate entry error, If we need to allow duplicates
DUPLICATE_JUNK_FAX_ENTRY_TITLE = "Duplicate Junk Fax Number";
DUPLICATE_JUNK_FAX_ENTRY_DESC = "This number is already on the Junk Fax list. Do you wish to add it again?";

//Duplicate entry Error.
DUPLICATE_JUNK_FAX_ENTRY_TITLE1 = "Duplicate Junk Fax Number";
DUPLICATE_JUNK_FAX_ENTRY_DESC1 = "This number is already on the Junk Fax list.";

// explanation why the fax setting were not applied
FaxNotAppliedExplanation = "Check if the device is online and connected, and is not processing a fax job.";

HSDTaskDescriptionTitle = "Use Junk Fax Blocking to block incoming faxes from selected Caller ID numbers.";
HSDJunkFaxBlockingStateTitle = "Caller ID Fax Blocking:";
HSDBlockedNumbersTitle = "Blocked Numbers:";
HSDApplyButtonTitle = "Apply Now";
HSDPrintListButtonTitle = "Print List";

HSDEditPanelDescriptionTitle = "Enter fax number to block:";
HSDOffButtonTitle = "Off";
HSDOnButtonTitle = "On";

HSDFaxNumberTitle = "Fax Number";
HSDEditButtonTitle = "Edit...";
HSDCreateButtonTitle = "Create";
HSDCancelButtonTitle = "Cancel";

AskSaveChangesAlertTitle = "You have edited the fax blocking list";
AskSaveChangesAlertMsg = "The changes you've made will not be included in the printed list, if you do not apply them. Do you want to apply the changes you've made to the list, before printing it?";
AskSaveChangesDontApplyButtonTitle = "Don't Apply";
AskSaveCahngesApplyButtonTitle = "Apply";

PlusButtonToolTip = "Add New Blocked Number";
MinusButtonToolTip = "Delete Blocked Number";
EditButtonToolTip = "Edit Blocked Number";
PrintButtonToolTip = "Print Blocked Numbers";
